---
type: FileOpenDialog
namespace: Autodesk.Revit.UI
version: 2024
members: 2
tags: [revit-api, class]
---

# FileOpenDialog

`Autodesk.Revit.UI.FileOpenDialog` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FileOpenDialog | 2017 | `public FileOpenDialog ( string filter )` |
| Property | ShowPreview | 2017 | `public bool ShowPreview { get ; set ; }` |